examples/openfoam_case_run_case/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

solver          incompressibleFluid;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.1;
deltaT          0.001;

writeControl    timeStep;
writeInterval   100;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable false;
