examples/openfoam_case_run_case/Allrun
#!/bin/sh
set -eu

case_dir=$(CDPATH= cd -- "$(dirname -- "$0")" && pwd)
cd "$case_dir"

blockMesh
foamRun
